Day7-commandsforhumanlanguages-texteditor.org
* Day 7 - Commands for Human Languages and Editing
Emacs is wonderful for text editing and related stuff with text. It has many modes which helps in editing and managing text, which help increase the productive overall, here I explored some of the major modes and commands which can quickly help for editing text.

** Text Editing in Emacs
Emacs has several major modes for handelling text, there is text mode for ordinary text which customizes emacs in small ways for syntactic convention of text. Outline mode provides special commands to handle text, Org Mode extends Outline mode and turns emacs into a full fledged organizer: we can manage TODO Lists, store notes and publish them in many formats and I would speak more about this in my coming days learnings. TeX and LaTeX mode contains embedded commands; HTML mode for HTML and SGML Modes; nxml-mode for XML Mode; Nroff Mode for Groff and Nroff Mode.

It is also possible to edit pictures made out of text characters, also referred as *"ASCII art"* using Picture mode.

** Words
There are several commnads in emacs for operating on words and many of these I have already covered in my Day-1 and Day-4, but let me redo, so I will remeber it for a long time.
Again, the *M* refers the Meta i.e the Alt or Esc key on the keyboard and is followed by the character keys.

| Key bindings | commands           | description                                  |
|--------------+--------------------+----------------------------------------------|
| M-f          | forward-word       | Self descriptive as it moves forward on word |
| M-b          | backward-word      | it moves one word back.                      |
| M-d          | kill-word          | kills up to the end of the word              |
| M-<DEL>      | backward-kill-word | kill backward to the beginning of the word.  |
| M-@          | mark-word          | Mark to the end of the word                  |
| M-t          | transpose-words    | Transpose the word and drag across others    |
| M-=          | count-words-region | gives the count of the words in the region.  |


/NOTES:/
/1. These keys parrellel with the character-based movements/
/2. The numeric arguments serves as the repeat count and the negative arguments would make the commands move in the opposite direction./
/3. M-<DEL> deletes the word to the point where M-b would end, it will kill the comma and space as well, M-b M-d to just kill the word but not the comma./
/4. If we choose there keybindings in our shell *(set -o emacs)*, these word keybindings can help us in moving around the long commands./

** Sentences
The meta keys are also helpful in moving around the sentences.

| Keybindings | commands               | description                                               |
|-------------+------------------------+-----------------------------------------------------------|
| M-a         | backward-sentence      | This will move the point to the beginning of the sentence |
| M-e         | forward-sentence       | Will move forward to the end of sentence.                 |
| M-k         | kill-sentence          | Kill forward to the end of the sentence.                  |
| C-x <DEL>   | backward-kill-sentence | kill back to the beginning of the sentence.               |

*** Quoting from EMACS Manual
#+BEGIN_SRC Quote
 The sentence commands assume that you follow the American typist's
convention of putting two spaces at the end of a sentence.  That is, a
sentence ends wherever there is a `.', `?' or `!' followed by the end
of a line or two spaces, with any number of `)', `]', `'', or `"'
characters allowed in between.  A sentence also begins or ends wherever
a paragraph begins or ends.  It is useful to follow this convention,
because it allows the Emacs sentence commands to distinguish between
periods that end a sentence and periods that indicate abbreviations.
#+END_SRC Quote

/NOTE:/
/1. To use just one space between sentences, set the variable sentence-end-double-space to nil and to make the sentence commands stop for single spaces./
/2. The variable sentence-end controls how to recognize the end of the sentence; its value is a regular expression, which is used to match the last few characters of the sentence./
/3. Some languages such as Thai, doesn't end with periods; such cases can be handeld by setting variable sentence-end-without-period to t./

** Paragraphs

| Keybindings | Commands           | Description                                       |
|-------------+--------------------+---------------------------------------------------|
| M-{         | backward-paragraph | move to the beginning of paragraph.               |
| M-}         | forward-paragraph  | Move to the end of the next paragraph.            |
| M-h         | mark-paragraph     | put point and mark around this or next paragraph. |
| M-h C-w     |                    | kills the paragraph around or after point.        |
/Notes:/
/1. The definition of a paragraph boundary is controlled by the variables *paragraph-separate* and  *paragraph-start*. The value of these are regular expression./
/2. In fundamental mode, Paragraph-start is *"\f\\|[ \t]*$"* and matches lines that either start or separate paragraph./ 
/3. Paragraph separate is *"[ \t\f]*$"* and matches lines  that separate paragraph without being part of any paragraph./

