Day7-commandsforhumanlanguages-texteditor.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Day7-commandsforhumanlanguages-texteditor</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Day7-commandsforhumanlanguages-texteditor"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-05T18:42+0530"/>
<meta name="author" content="Om Prakash Singh"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Day7-commandsforhumanlanguages-texteditor</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Day 7 - Commands for Human Languages and Editing</a>
<ul>
<li><a href="#sec-1-1">1.1 Text Editing in Emacs</a></li>
<li><a href="#sec-1-2">1.2 Words</a></li>
<li><a href="#sec-1-3">1.3 Sentences</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Quoting from EMACS Manual</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Paragraphs</a></li>
<li><a href="#sec-1-5">1.5 Pages</a></li>
<li><a href="#sec-1-6">1.6 Filling Text</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 Auto Fill</a></li>
<li><a href="#sec-1-6-2">1.6.2 Fill Commands</a></li>
<li><a href="#sec-1-6-3">1.6.3 The Fill Prefix</a></li>
<li><a href="#sec-1-6-4">1.6.4 Adaptive Fill.</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 Case</a></li>
<li><a href="#sec-1-8">1.8 Text Mode</a></li>
<li><a href="#sec-1-9">1.9 Outline Mode</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1 Outline Format</a></li>
<li><a href="#sec-1-9-2">1.9.2 Outline mode commands</a></li>
<li><a href="#sec-1-9-3">1.9.3 Outline visibility commands</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10 Org Mode</a>
<ul>
<li><a href="#sec-1-10-1">1.10.1 Org as an Organizer</a></li>
<li><a href="#sec-1-10-2">1.10.2 Org as an authoring system</a></li>
</ul>
</li>
<li><a href="#sec-1-11">1.11 TeX Mode</a></li>
<li><a href="#sec-1-12">1.12 SGML and HTML Modes</a></li>
<li><a href="#sec-1-13">1.13 Nroff mode</a></li>
<li><a href="#sec-1-14">1.14 Enriched Text</a></li>
<li><a href="#sec-1-15">1.15 Editing Text Based Tables</a></li>
<li><a href="#sec-1-16">1.16 Two column editing</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Day 7 - Commands for Human Languages and Editing</h2>
<div class="outline-text-2" id="text-1">

<p>Emacs is wonderful for text editing and related stuff with text. It has many modes which helps in editing and managing text, which help increase the productive overall, here I explored some of the major modes and commands which can quickly help for editing text.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Text Editing in Emacs</h3>
<div class="outline-text-3" id="text-1-1">

<p>Emacs has several major modes for handelling text, there is text mode for ordinary text which customizes emacs in small ways for syntactic convention of text. Outline mode provides special commands to handle text, Org Mode extends Outline mode and turns emacs into a full fledged organizer: we can manage TODO Lists, store notes and publish them in many formats and I would speak more about this in my coming days learnings. TeX and LaTeX mode contains embedded commands; HTML mode for HTML and SGML Modes; nxml-mode for XML Mode; Nroff Mode for Groff and Nroff Mode.
</p>
<p>
It is also possible to edit pictures made out of text characters, also referred as *"ASCII art"* using Picture mode.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Words</h3>
<div class="outline-text-3" id="text-1-2">

<p>There are several commnads in emacs for operating on words and many of these I have already covered in my Day-1 and Day-4, but let me redo, so I will remeber it for a long time.
Again, the <b>M</b> refers the Meta i.e the Alt or Esc key on the keyboard and is followed by the character keys.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key bindings</th><th scope="col" class="left">commands</th><th scope="col" class="left">description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-f</td><td class="left">forward-word</td><td class="left">Self descriptive as it moves forward on word</td></tr>
<tr><td class="left">M-b</td><td class="left">backward-word</td><td class="left">it moves one word back.</td></tr>
<tr><td class="left">M-d</td><td class="left">kill-word</td><td class="left">kills up to the end of the word</td></tr>
<tr><td class="left">M-&lt;DEL&gt;</td><td class="left">backward-kill-word</td><td class="left">kill backward to the beginning of the word.</td></tr>
<tr><td class="left">M-@</td><td class="left">mark-word</td><td class="left">Mark to the end of the word</td></tr>
<tr><td class="left">M-t</td><td class="left">transpose-words</td><td class="left">Transpose the word and drag across others</td></tr>
<tr><td class="left">M-=</td><td class="left">count-words-region</td><td class="left">gives the count of the words in the region.</td></tr>
</tbody>
</table>



<p>
<i>NOTES:</i>
<i>1. These keys parrellel with the character-based movements</i>
<i>2. The numeric arguments serves as the repeat count and the negative arguments would make the commands move in the opposite direction.</i>
<i>3. M-&lt;DEL&gt; deletes the word to the point where M-b would end, it will kill the comma and space as well, M-b M-d to just kill the word but not the comma.</i>
<i>4. If we choose there keybindings in our shell *(set -o emacs)*, these word keybindings can help us in moving around the long commands.</i>
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Sentences</h3>
<div class="outline-text-3" id="text-1-3">

<p>The meta keys are also helpful in moving around the sentences.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">commands</th><th scope="col" class="left">description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-a</td><td class="left">backward-sentence</td><td class="left">This will move the point to the beginning of the sentence</td></tr>
<tr><td class="left">M-e</td><td class="left">forward-sentence</td><td class="left">Will move forward to the end of sentence.</td></tr>
<tr><td class="left">M-k</td><td class="left">kill-sentence</td><td class="left">Kill forward to the end of the sentence.</td></tr>
<tr><td class="left">C-x &lt;DEL&gt;</td><td class="left">backward-kill-sentence</td><td class="left">kill back to the beginning of the sentence.</td></tr>
</tbody>
</table>



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Quoting from EMACS Manual</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-Quote"> The sentence commands assume that you follow the American typist's
convention of putting two spaces at the end of a sentence.  That is, a
sentence ends wherever there is a `.', `?' or `!' followed by the end
of a line or two spaces, with any number of `)', `]', `'', or `<span style="color: #2aa198;">"'</span>
<span style="color: #2aa198;">characters allowed in between.  A sentence also begins or ends wherever</span>
<span style="color: #2aa198;">a paragraph begins or ends.  It is useful to follow this convention,</span>
<span style="color: #2aa198;">because it allows the Emacs sentence commands to distinguish between</span>
<span style="color: #2aa198;">periods that end a sentence and periods that indicate abbreviations.</span>
</pre>


<p>
<i>NOTE:</i>
<i>1. To use just one space between sentences, set the variable sentence-end-double-space to nil and to make the sentence commands stop for single spaces.</i>
<i>2. The variable sentence-end controls how to recognize the end of the sentence; its value is a regular expression, which is used to match the last few characters of the sentence.</i>
<i>3. Some languages such as Thai, doesn't end with periods; such cases can be handeld by setting variable sentence-end-without-period to t.</i>
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Paragraphs</h3>
<div class="outline-text-3" id="text-1-4">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-{</td><td class="left">backward-paragraph</td><td class="left">move to the beginning of paragraph.</td></tr>
<tr><td class="left">M-}</td><td class="left">forward-paragraph</td><td class="left">Move to the end of the next paragraph.</td></tr>
<tr><td class="left">M-h</td><td class="left">mark-paragraph</td><td class="left">put point and mark around this or next paragraph.</td></tr>
<tr><td class="left">M-h C-w</td><td class="left"></td><td class="left">kills the paragraph around or after point.</td></tr>
</tbody>
</table>

<i>Notes:</i>
<i>1. The definition of a paragraph boundary is controlled by the variables *paragraph-separate* and  *paragraph-start*. The value of these are regular expression.</i>
<i>2. In fundamental mode, Paragraph-start is *"\f\\|[ \t]*\("* and matches lines that either start or separate paragraph.</i> 
<i>3. Paragraph separate is *"[ \t\f]*\)"* and matches lines  that separate paragraph without being part of any paragraph.</i>

</div>

</div>
