Day7-commandsforhumanlanguages-texteditor.org
** Pages
The files are divided into pages delimited by the "formfeed character" (ASCII code 2, denoted as <contorl-l>) and in emacs is escape sequence .

| Keybindings   | Commands         | Description                                              |
|---------------+------------------+----------------------------------------------------------|
| M-x What-page |                  | Display the page number and line number within that page |
| C-x [         | backward-page    | Move point to the previous page boundary.                |
| C-x ]         | forward-page     | Move point ot next page boundary                         |
| C-x C-p       | mark-page        | put point and mark around this page.                     |
| C-x C-p C-w   |                  | select and kill the page                                 |
| C-x l         | count-lines-page | Count the lines in this page.                            |

/Note:/
/page-delimiter control where the page begins. Its a regular expression *"f"* which matches a beginning of a line that separate pages./

** Filling Text
Filling text means breaking up the lines that fit a specified width. Emacs does the filling in 2 ways. *Auto Fill Mode* inserts text with self-inserting characters and automatically fills it. *Explicit fill Commands*  can be used for editing texts.
*** Auto Fill
This is a minor mode in which the lines are broken automatically when they become too wide, breaking up of lines only happens when you type <SPC> or <RET>.

'M-x auto-fill-mode' : Toggles the Auto Fill mode.

'<SPC>/<RET>' : Break lines when appropriate.

From the command line the auto-fill mode enables or disables the mode for current buffer. From LISP /auto-fill/ is enabled when called with omitted or nil argument. for enabling in the major modes, add auto-fill-mode in mode hooks. When the mode it enabled it will show *Fill* in the mode line.

This mode breaks any line which goes longer than the desired width by pressing <SPC> or <RET>, and to insert a SPACE or any newline without breaking the lines tye *C-q <SPC>* or *C-q C-j* and *C-o* for inserting new line.
 
Auto fill mode does not refill the paragraphs; it break lines but does not merge lines, editing in the middle of the paragraph can result in paragraph which is not correctly filled. To fill them correctly we may need to use explicit Fill Commands.

*** Fill Commands

| Key bindings                 | Command         | Description                               |
|------------------------------+-----------------+-------------------------------------------|
| M-q                          | fill-paragraph  | Fill current paragraph                    |
| C-x f                        | set-fill-column | Set the fill column                       |
| M-x fill-region              | fill-region     | Fill each paragraph in the region.        |
| M-x fill-region-as-paragraph |                 | Fill the region consider it as paragraph. |
| M-o M-s                      |                 | Center a line.                            |

/Notes:/
/1. M-q and fill-region uses the usual emacs criteria for finding paragraph boundaries, which refills everything between point and mark as single paragraph./
/2. Numeric argument to *M-q* justifies the text as well as fill it./
/3. To Remove extra spaces, use M-q with no argument./
/4. The default vault for fill column is 70./
/5. *C-x f* (sets-fill-column) sets the numeric value for fill column. With just C-u as argument it sets fill-column to the current horizantal position of point./
/6. By default, emacs consider a period followed  by two spaces or by a newline as the end of sentence; a period with just one space will be called as abbrevation and not the end of the sentence./
/7. Setting 'sentence-end-double-space' to nil the fill commands will break a line after a period followed by a period and a space./

*** The Fill Prefix

| Keybindings                    | Command         | Description                                                                          |
|--------------------------------+-----------------+--------------------------------------------------------------------------------------|
| C-x .                          | set-fill-prefix | Set the fill prefix                                                                  |
| M-q                            | fill-paragraph  | Fill a paragraph using current fill prefix                                           |
| M-x fill-individual-paragraphs |                 | Fill the region, considering each change of indentation as starting a new paragraph. |
| M-x fill-nonuniform-paragraphs |                 | Consider only paragraph separator lines as starting a new paragraph.                 |

/Notes:/
/1. Move to a line which starts with desired prefix, put point at the end of the prefix and type C-x ./
/2. To turn off a prefix, specify an empty prefix: type C-x . with point at the beginning of line./
/3. The fill prefix is stored in fill-prefix variable. if the value is nil, then there is no fill prefix./

This feature allows paragraphs to be filled so each line starts with a special string of characters (such a sequence of spaces, giving and indented paragraph). you can specify fill prefix explicitly; otherwise emacs tries to deduce automatically.

