Day7-commandsforhumanlanguages-texteditor.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Pages</h3>
<div class="outline-text-3" id="text-1-5">

<p>The files are divided into pages delimited by the "formfeed character" (ASCII code 2, denoted as &lt;contorl-l&gt;) and in emacs is escape sequence .
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-x What-page</td><td class="left"></td><td class="left">Display the page number and line number within that page</td></tr>
<tr><td class="left">C-x [</td><td class="left">backward-page</td><td class="left">Move point to the previous page boundary.</td></tr>
<tr><td class="left">C-x ]</td><td class="left">forward-page</td><td class="left">Move point ot next page boundary</td></tr>
<tr><td class="left">C-x C-p</td><td class="left">mark-page</td><td class="left">put point and mark around this page.</td></tr>
<tr><td class="left">C-x C-p C-w</td><td class="left"></td><td class="left">select and kill the page</td></tr>
<tr><td class="left">C-x l</td><td class="left">count-lines-page</td><td class="left">Count the lines in this page.</td></tr>
</tbody>
</table>


<p>
<i>Note:</i>
<i>page-delimiter control where the page begins. Its a regular expression *"f"* which matches a beginning of a line that separate pages.</i>
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Filling Text</h3>
<div class="outline-text-3" id="text-1-6">

<p>Filling text means breaking up the lines that fit a specified width. Emacs does the filling in 2 ways. <b>Auto Fill Mode</b> inserts text with self-inserting characters and automatically fills it. <b>Explicit fill Commands</b>  can be used for editing texts.
</p>
</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Auto Fill</h4>
<div class="outline-text-4" id="text-1-6-1">

<p>This is a minor mode in which the lines are broken automatically when they become too wide, breaking up of lines only happens when you type &lt;SPC&gt; or &lt;RET&gt;.
</p>
<p>
'M-x auto-fill-mode' : Toggles the Auto Fill mode.
</p>
<p>
'&lt;SPC&gt;/&lt;RET&gt;' : Break lines when appropriate.
</p>
<p>
From the command line the auto-fill mode enables or disables the mode for current buffer. From LISP <i>auto-fill</i> is enabled when called with omitted or nil argument. for enabling in the major modes, add auto-fill-mode in mode hooks. When the mode it enabled it will show <b>Fill</b> in the mode line.
</p>
<p>
This mode breaks any line which goes longer than the desired width by pressing &lt;SPC&gt; or &lt;RET&gt;, and to insert a SPACE or any newline without breaking the lines tye <b>C-q &lt;SPC&gt;</b> or <b>C-q C-j</b> and <b>C-o</b> for inserting new line.
</p>
<p> 
Auto fill mode does not refill the paragraphs; it break lines but does not merge lines, editing in the middle of the paragraph can result in paragraph which is not correctly filled. To fill them correctly we may need to use explicit Fill Commands.
</p>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Fill Commands</h4>
<div class="outline-text-4" id="text-1-6-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key bindings</th><th scope="col" class="left">Command</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-q</td><td class="left">fill-paragraph</td><td class="left">Fill current paragraph</td></tr>
<tr><td class="left">C-x f</td><td class="left">set-fill-column</td><td class="left">Set the fill column</td></tr>
<tr><td class="left">M-x fill-region</td><td class="left">fill-region</td><td class="left">Fill each paragraph in the region.</td></tr>
<tr><td class="left">M-x fill-region-as-paragraph</td><td class="left"></td><td class="left">Fill the region consider it as paragraph.</td></tr>
<tr><td class="left">M-o M-s</td><td class="left"></td><td class="left">Center a line.</td></tr>
</tbody>
</table>


<p>
<i>Notes:</i>
<i>1. M-q and fill-region uses the usual emacs criteria for finding paragraph boundaries, which refills everything between point and mark as single paragraph.</i>
<i>2. Numeric argument to *M-q* justifies the text as well as fill it.</i>
<i>3. To Remove extra spaces, use M-q with no argument.</i>
<i>4. The default vault for fill column is 70.</i>
<i>5. *C-x f* (sets-fill-column) sets the numeric value for fill column. With just C-u as argument it sets fill-column to the current horizantal position of point.</i>
<i>6. By default, emacs consider a period followed  by two spaces or by a newline as the end of sentence; a period with just one space will be called as abbrevation and not the end of the sentence.</i>
<i>7. Setting 'sentence-end-double-space' to nil the fill commands will break a line after a period followed by a period and a space.</i>
</p>
</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> The Fill Prefix</h4>
<div class="outline-text-4" id="text-1-6-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Command</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">C-x .</td><td class="left">set-fill-prefix</td><td class="left">Set the fill prefix</td></tr>
<tr><td class="left">M-q</td><td class="left">fill-paragraph</td><td class="left">Fill a paragraph using current fill prefix</td></tr>
<tr><td class="left">M-x fill-individual-paragraphs</td><td class="left"></td><td class="left">Fill the region, considering each change of indentation as starting a new paragraph.</td></tr>
<tr><td class="left">M-x fill-nonuniform-paragraphs</td><td class="left"></td><td class="left">Consider only paragraph separator lines as starting a new paragraph.</td></tr>
</tbody>
</table>


<p>
<i>Notes:</i>
<i>1. Move to a line which starts with desired prefix, put point at the end of the prefix and type C-x .</i>
<i>2. To turn off a prefix, specify an empty prefix: type C-x . with point at the beginning of line.</i>
<i>3. The fill prefix is stored in fill-prefix variable. if the value is nil, then there is no fill prefix.</i>
</p>
<p>
This feature allows paragraphs to be filled so each line starts with a special string of characters (such a sequence of spaces, giving and indented paragraph). you can specify fill prefix explicitly; otherwise emacs tries to deduce automatically.
</p>
</div>

</div>
