Day7-commandsforhumanlanguages-texteditor.org
*** Adaptive Fill.
The fill command deduce the proper fill prefix for a paragraph automatically in some cases; either white spaces or certain precaution characters at the beginning of line are propagated to all lines of the paragraph.

If the paragraph has two or more lines, the fill prefix is taken from the paragraph's second line, but only if it appears on the first line as well.

If a paragraph has just one line, fill commands _may_ take a prefix from that line.  The decision is complicated because there are three reasonable things to do in such a case: 

   * Use the first line's prefix on all the lines of the paragraph.

   * Indent subsequent lines with whitespace, so that they line up under the text that follows the prefix on the first line, but don't actually copy the      
     prefix from the first line.

   * Don't do anything special with the second and following lines.

All three of these styles of formatting are commonly used.  So the fill commands try to determine what you would like, based on the prefix that appears and on the major mode.  Here is how.

If the prefix found on the first line matches `adaptive-fill-first-line-regexp', or if it appears to be a comment-starting sequence (this depends on the major mode), then the prefix found is used for filling the paragraph, provided it would not act as a paragraph starter on subsequent lines.

Otherwise, the prefix found is converted to an equivalent number of spaces, and those spaces are used as the fill prefix for the rest of the lines, provided they would not act as a paragraph starter on subsequent lines.

In Text mode, and other modes where only blank lines and page delimiters separate paragraphs, the prefix chosen by adaptive filling never acts as a paragraph starter, so it can always be used for filling.

The variable `adaptive-fill-regexp' determines what kinds of line beginnings can serve as a fill prefix: any characters at the start of the line that match this regular expression are used.  If you set the variable `adaptive-fill-mode' to `nil', the fill prefix is never chosen automatically.

You can specify more complex ways of choosing a fill prefix automatically by setting the variable `adaptive-fill-function' to a function.  This function is called with point after the left margin of a line, and it should return the appropriate fill prefix based on that line.  If it returns `nil', `adaptive-fill-regexp' gets a chance to find a prefix.

** Case
| Keybindings | Commands        | Description                               |
|-------------+-----------------+-------------------------------------------|
| M-l         | downcase-word   | Convert the following word to lower case. |
| M-u         | upcase-word     | Convert the following word to upper case. |
| M-c         | capitalize-word | Capitalize the following word.            |
| C-x C-l     | downcase-region | Convert region to lowercase.              |
| C-x C-u     | upcase-region   | Convert region to upper case.             |

/Note:/
/1. When a negative argument, the case conversion applies to appropriate no. of words before point, but do not move the point, its convinent if I typed something in wrong case and want to correct the case./
/2. In case the command to change case is given in the middle of the word, the case change would happen from the point to the end of the word./

** Text Mode
This is the major mode for editing the text language, any file ending with .txt will automatically enables this mode; and this mode can also be called by M-x text-mode. Blank lines and page delimiters separate paragraphs, and as a result paragraphs can be indented, and adaptive filling determines what indentation to use when filling a paragraph. The <TAB> usually inserts whitespace up to the next tab stop, instead of indenting the current line.

Text mode turns off comments features except when you explicitly invoke them. It changes so that the single quotes are considered part of the words. But if a word starts with a single quote it is treated as a prefix for the purpose of capitalization. Entering text-mode invokes text-mode-hook.

** Outline Mode
This is major mode derived from Text mode, which is specialized for editing outlines; it provides commands to navigate between entries in the outline structure. Type M-x outline-mode to switch to outline mode, entering this mode runs the hook text-mode-hook followed by outline-mode-hook.

When in outline mode use command to make a line invisible it disappears the line and ellipsis(three periods in a row) is displayed at the end of the previous visible line.

Editing command on lines, such as C-n and C-p treat the text of the invisible line as part of the previous visible line.

outline-minor-mode toggle outline minor mode in the current buffer, it is a buffer-local minor mode which provides the same commands as the major mode for the current buffer, this provides special keybindings with C-c prefix, and C-c @ as the prefix in minor-mode.

*** Outline Format
Outline mode assumes the the lines in the buffer are of two types:
"heading lines" and "body lines"

Heading line: start with one or more asterisk ('*'); the number of asterisks determines the depth of the heading in the outline structure. 
Body Line: Any line which is not a heading line is a body line. Body line belong with a preceding heading line.

A heading line and a body line collectively is called as an entry.


*** Outline mode commands

| Key bindings | Commands                         | Description                                                    |
|--------------+----------------------------------+----------------------------------------------------------------|
| C-c C-n      | outline-next-visible-heading     | Move point to the next visible heading                         |
| C-c C-p      | outline-previous-visible-heading | Move point to the previous visible heading.                    |
| C-c C-f      | outline-forward-same-level       | Move point to the next visible heading line at the same level. |
| C-c C-b      | outline-backward-same-level      | Move point to previous heading line at the same level.         |
| C-c C-u      | outline-up-heading               | Move point up to a lower-level.                                |

