Day7-commandsforhumanlanguages-texteditor.html

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> Adaptive Fill.</h4>
<div class="outline-text-4" id="text-1-6-4">

<p>The fill command deduce the proper fill prefix for a paragraph automatically in some cases; either white spaces or certain precaution characters at the beginning of line are propagated to all lines of the paragraph.
</p>
<p>
If the paragraph has two or more lines, the fill prefix is taken from the paragraph's second line, but only if it appears on the first line as well.
</p>
<p>
If a paragraph has just one line, fill commands <span style="text-decoration:underline;">may</span> take a prefix from that line.  The decision is complicated because there are three reasonable things to do in such a case: 
</p>
<ul>
<li>Use the first line's prefix on all the lines of the paragraph.

</li>
<li>Indent subsequent lines with whitespace, so that they line up under the text that follows the prefix on the first line, but don't actually copy the      
     prefix from the first line.

</li>
<li>Don't do anything special with the second and following lines.
</li>
</ul>


<p>
All three of these styles of formatting are commonly used.  So the fill commands try to determine what you would like, based on the prefix that appears and on the major mode.  Here is how.
</p>
<p>
If the prefix found on the first line matches `adaptive-fill-first-line-regexp', or if it appears to be a comment-starting sequence (this depends on the major mode), then the prefix found is used for filling the paragraph, provided it would not act as a paragraph starter on subsequent lines.
</p>
<p>
Otherwise, the prefix found is converted to an equivalent number of spaces, and those spaces are used as the fill prefix for the rest of the lines, provided they would not act as a paragraph starter on subsequent lines.
</p>
<p>
In Text mode, and other modes where only blank lines and page delimiters separate paragraphs, the prefix chosen by adaptive filling never acts as a paragraph starter, so it can always be used for filling.
</p>
<p>
The variable `adaptive-fill-regexp' determines what kinds of line beginnings can serve as a fill prefix: any characters at the start of the line that match this regular expression are used.  If you set the variable `adaptive-fill-mode' to `nil', the fill prefix is never chosen automatically.
</p>
<p>
You can specify more complex ways of choosing a fill prefix automatically by setting the variable `adaptive-fill-function' to a function.  This function is called with point after the left margin of a line, and it should return the appropriate fill prefix based on that line.  If it returns `nil', `adaptive-fill-regexp' gets a chance to find a prefix.
</p>
</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Case</h3>
<div class="outline-text-3" id="text-1-7">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-l</td><td class="left">downcase-word</td><td class="left">Convert the following word to lower case.</td></tr>
<tr><td class="left">M-u</td><td class="left">upcase-word</td><td class="left">Convert the following word to upper case.</td></tr>
<tr><td class="left">M-c</td><td class="left">capitalize-word</td><td class="left">Capitalize the following word.</td></tr>
<tr><td class="left">C-x C-l</td><td class="left">downcase-region</td><td class="left">Convert region to lowercase.</td></tr>
<tr><td class="left">C-x C-u</td><td class="left">upcase-region</td><td class="left">Convert region to upper case.</td></tr>
</tbody>
</table>


<p>
<i>Note:</i>
<i>1. When a negative argument, the case conversion applies to appropriate no. of words before point, but do not move the point, its convinent if I typed something in wrong case and want to correct the case.</i>
<i>2. In case the command to change case is given in the middle of the word, the case change would happen from the point to the end of the word.</i>
</p>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Text Mode</h3>
<div class="outline-text-3" id="text-1-8">

<p>This is the major mode for editing the text language, any file ending with .txt will automatically enables this mode; and this mode can also be called by M-x text-mode. Blank lines and page delimiters separate paragraphs, and as a result paragraphs can be indented, and adaptive filling determines what indentation to use when filling a paragraph. The &lt;TAB&gt; usually inserts whitespace up to the next tab stop, instead of indenting the current line.
</p>
<p>
Text mode turns off comments features except when you explicitly invoke them. It changes so that the single quotes are considered part of the words. But if a word starts with a single quote it is treated as a prefix for the purpose of capitalization. Entering text-mode invokes text-mode-hook.
</p>
</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Outline Mode</h3>
<div class="outline-text-3" id="text-1-9">

<p>This is major mode derived from Text mode, which is specialized for editing outlines; it provides commands to navigate between entries in the outline structure. Type M-x outline-mode to switch to outline mode, entering this mode runs the hook text-mode-hook followed by outline-mode-hook.
</p>
<p>
When in outline mode use command to make a line invisible it disappears the line and ellipsis(three periods in a row) is displayed at the end of the previous visible line.
</p>
<p>
Editing command on lines, such as C-n and C-p treat the text of the invisible line as part of the previous visible line.
</p>
<p>
outline-minor-mode toggle outline minor mode in the current buffer, it is a buffer-local minor mode which provides the same commands as the major mode for the current buffer, this provides special keybindings with C-c prefix, and C-c @ as the prefix in minor-mode.
</p>

</div>

<div id="outline-container-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> Outline Format</h4>
<div class="outline-text-4" id="text-1-9-1">

<p>Outline mode assumes the the lines in the buffer are of two types:
"heading lines" and "body lines"
</p>
<p>
Heading line: start with one or more asterisk ('*'); the number of asterisks determines the depth of the heading in the outline structure. 
Body Line: Any line which is not a heading line is a body line. Body line belong with a preceding heading line.
</p>
<p>
A heading line and a body line collectively is called as an entry.
</p>

</div>

</div>

<div id="outline-container-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> Outline mode commands</h4>
<div class="outline-text-4" id="text-1-9-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key bindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">C-c C-n</td><td class="left">outline-next-visible-heading</td><td class="left">Move point to the next visible heading</td></tr>
<tr><td class="left">C-c C-p</td><td class="left">outline-previous-visible-heading</td><td class="left">Move point to the previous visible heading.</td></tr>
<tr><td class="left">C-c C-f</td><td class="left">outline-forward-same-level</td><td class="left">Move point to the next visible heading line at the same level.</td></tr>
<tr><td class="left">C-c C-b</td><td class="left">outline-backward-same-level</td><td class="left">Move point to previous heading line at the same level.</td></tr>
<tr><td class="left">C-c C-u</td><td class="left">outline-up-heading</td><td class="left">Move point up to a lower-level.</td></tr>
</tbody>
</table>


</div>

</div>
