Day7-commandsforhumanlanguages-texteditor.org
*** Outline visibility commands

| Keybindings | Commands       | Description                                                             |
|-------------+----------------+-------------------------------------------------------------------------|
| C-c C-c     | hide-entry     | Make the current heading line's body invisible                          |
| C-c C-e     | show-entry     | Make the current heading line's body visible                            |
| C-c C-d     | hide-subtree   | Make everything under the heading invisible excluding the heading       |
| C-c C-s     | show-subtree   | Make everything under the current heading visible                       |
| C-c C-l     | hide-leaves    | Make the body of the current heading line, and all of its subheadings   |
| C-c C-k     | show-branches  | Make all subheading of the current heading line, at all levels, visible |
| C-c C-i     | show-children  | Make immediate subheadings of the current heading line visible          |
| C-c C-t     | hide-body      | Make all body lines in the buffer invisible                             |
| C-c C-a     | show-all       | Make all line in the buffer visible                                     |
| C-c C-q     | hide-sublevels | Hide everything except the top N level of heading lines                 |
| C-c C-o     | hide-other     | HIde everything except the heading or the body that point is in         |

And most of these commands may work differently in org-mode, the org-mode is an advance implementation of outline-mode. I will be writing about this mode in my later days. It may confuse me at a later stage as mainly I use org-mode for my purposes of note taking and writing this blog. Let me provide some brief introduction to the org-mode.

** Org Mode
Org mode, as in outline mode, each entry has a heading line that starts with one or more asterisk (*); Any line beginning with a '#' is considered as a comment. and it also provides commands to view and manipulate the outline structure. 

The simplest of these commands is <TAB> (org-cycle). If invoked on heading line, it cycles through different visiblity states of that subtree:
1. Showing only the heading line.
2. Show only the heading lines and the heading lines of its direct children.
3. Show the entire subtree.

The <S-TAB> (org-shifttab) in an org mode cycle visiblity of entire online subtree
1. Show only top-level heading lines.
2. Show all heading lines but no body lines.
3. Show everything.

We can move the entire entry up and down in the buffer, including its body lines and subtree, by typing M-<up> (org-metaup) or M-<down> (org-metadown) on the heading line. Similarly, it can promote or demote the heading line with M-<left> (org-metaleft) and M-<right (org-metaright). For details, [[h][The Org Mode Manual]].

*** Org as an Organizer
You can tag an Org entry as a "TODO" by typing *C-c C-t* (org-todo) anywhere in the entry. This adds /TODO/ keyword and typing the keyword *C-c C-t* again switches the keyword to /DONE/; press *C-c C-t* again and it will remove the keyword entirely. They keywords can be customized using the variable 'org-todo-keywords'

With the possiblity of marking an entry as TODO, we can also attach a date to it by typing *C-c C-s* (org-schedule), This prompts for a date by popping a calendar, and then adds the tag 'SCHEDULED', together with the selected date, beneath the heading line. *C-c C-d* (org-deadline) have the same effect except it adds the tag 'DEADLINE'.

Once you have some planned TODO items, you can add that file to the list of "agenda fileS" by typing *C-c [* (org-agenda-file-to-front). It allows us to maintain multiple agenda  files. The list of these agenda files are stored in the variable 'org-agenda-files'.

Typing M-x org-agenda lets view items coming from agenda file, this command prompts for what we want to see: a list of things to do this week, a list of TODO items with specific keywords.

*** Org as an authoring system
To format org notes nicely and to prepare them for export and publication, *C-c C-e* (org-export) to export buffer and prompts for a export format; includes HTML, LaTeX, OpenDocument(.odt), and PDF.

To export several files at once to a specified directory, either locally or over the network, we can define a list of projects through the variable 'org-publish-project-alist' 

Org supports a simple markup scheme for applying text formatting to exported documents:

     - This text is /emphasized/
     - This text is *in bold*
     - This text is _underlined_
     - This text uses =a teletype font=

     #+begin_quote
     ``This is a quote.''
     #+end_quote

     #+begin_example
     This is an example.
     #+end_example

** TeX Mode
Emacs provides special major modes for editing files written in TeX and its related formats. TeX is a powerful text formatter written by Donald Knuth; like GNU Emacs. Latex is a simplified input format for TeX implemented using TeX macros. DocTeX is a special file format in which the LateX sources are written, combining sources with documentation. 

TeX mode has four variants:
1. Plain TeX mode
2. LateX mode.
3. DocTeX mode.
4. SliTeX mode.

These distinc major modes differ only slightly, and are designed for editing the four different format. Emacs selects the appropriate mode by looking at the contents of the buffer. Emacs chooses the mode specified by the variable 'tex-default-mode'; its default value is latex-mode. If Emacs doesn't get it right you can select the correct variant of TeX using the command 'M-x plain-tex-mode', 'M-x latex-mode', 'M-x slitex-mode', or 'M-x doctex-mode'.

