Day7-commandsforhumanlanguages-texteditor.html

<div id="outline-container-1-9-3" class="outline-4">
<h4 id="sec-1-9-3"><span class="section-number-4">1.9.3</span> Outline visibility commands</h4>
<div class="outline-text-4" id="text-1-9-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">C-c C-c</td><td class="left">hide-entry</td><td class="left">Make the current heading line's body invisible</td></tr>
<tr><td class="left">C-c C-e</td><td class="left">show-entry</td><td class="left">Make the current heading line's body visible</td></tr>
<tr><td class="left">C-c C-d</td><td class="left">hide-subtree</td><td class="left">Make everything under the heading invisible excluding the heading</td></tr>
<tr><td class="left">C-c C-s</td><td class="left">show-subtree</td><td class="left">Make everything under the current heading visible</td></tr>
<tr><td class="left">C-c C-l</td><td class="left">hide-leaves</td><td class="left">Make the body of the current heading line, and all of its subheadings</td></tr>
<tr><td class="left">C-c C-k</td><td class="left">show-branches</td><td class="left">Make all subheading of the current heading line, at all levels, visible</td></tr>
<tr><td class="left">C-c C-i</td><td class="left">show-children</td><td class="left">Make immediate subheadings of the current heading line visible</td></tr>
<tr><td class="left">C-c C-t</td><td class="left">hide-body</td><td class="left">Make all body lines in the buffer invisible</td></tr>
<tr><td class="left">C-c C-a</td><td class="left">show-all</td><td class="left">Make all line in the buffer visible</td></tr>
<tr><td class="left">C-c C-q</td><td class="left">hide-sublevels</td><td class="left">Hide everything except the top N level of heading lines</td></tr>
<tr><td class="left">C-c C-o</td><td class="left">hide-other</td><td class="left">HIde everything except the heading or the body that point is in</td></tr>
</tbody>
</table>


<p>
And most of these commands may work differently in org-mode, the org-mode is an advance implementation of outline-mode. I will be writing about this mode in my later days. It may confuse me at a later stage as mainly I use org-mode for my purposes of note taking and writing this blog. Let me provide some brief introduction to the org-mode.
</p>
</div>
</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Org Mode</h3>
<div class="outline-text-3" id="text-1-10">

<p>Org mode, as in outline mode, each entry has a heading line that starts with one or more asterisk (*); Any line beginning with a '#' is considered as a comment. and it also provides commands to view and manipulate the outline structure. 
</p>
<p>
The simplest of these commands is &lt;TAB&gt; (org-cycle). If invoked on heading line, it cycles through different visiblity states of that subtree:
</p><ol>
<li>Showing only the heading line.
</li>
<li>Show only the heading lines and the heading lines of its direct children.
</li>
<li>Show the entire subtree.
</li>
</ol>


<p>
The &lt;S-TAB&gt; (org-shifttab) in an org mode cycle visiblity of entire online subtree
</p><ol>
<li>Show only top-level heading lines.
</li>
<li>Show all heading lines but no body lines.
</li>
<li>Show everything.
</li>
</ol>


<p>
We can move the entire entry up and down in the buffer, including its body lines and subtree, by typing M-&lt;up&gt; (org-metaup) or M-&lt;down&gt; (org-metadown) on the heading line. Similarly, it can promote or demote the heading line with M-&lt;left&gt; (org-metaleft) and M-&lt;right (org-metaright). For details, <a href="#h">The Org Mode Manual</a>.
</p>

</div>

<div id="outline-container-1-10-1" class="outline-4">
<h4 id="sec-1-10-1"><span class="section-number-4">1.10.1</span> Org as an Organizer</h4>
<div class="outline-text-4" id="text-1-10-1">

<p>You can tag an Org entry as a "TODO" by typing <b>C-c C-t</b> (org-todo) anywhere in the entry. This adds <i>TODO</i> keyword and typing the keyword <b>C-c C-t</b> again switches the keyword to <i>DONE</i>; press <b>C-c C-t</b> again and it will remove the keyword entirely. They keywords can be customized using the variable 'org-todo-keywords'
</p>
<p>
With the possiblity of marking an entry as TODO, we can also attach a date to it by typing <b>C-c C-s</b> (org-schedule), This prompts for a date by popping a calendar, and then adds the tag 'SCHEDULED', together with the selected date, beneath the heading line. <b>C-c C-d</b> (org-deadline) have the same effect except it adds the tag 'DEADLINE'.
</p>
<p>
Once you have some planned TODO items, you can add that file to the list of "agenda fileS" by typing <b>C-c [</b> (org-agenda-file-to-front). It allows us to maintain multiple agenda  files. The list of these agenda files are stored in the variable 'org-agenda-files'.
</p>
<p>
Typing M-x org-agenda lets view items coming from agenda file, this command prompts for what we want to see: a list of things to do this week, a list of TODO items with specific keywords.
</p>
</div>

</div>

<div id="outline-container-1-10-2" class="outline-4">
<h4 id="sec-1-10-2"><span class="section-number-4">1.10.2</span> Org as an authoring system</h4>
<div class="outline-text-4" id="text-1-10-2">

<p>To format org notes nicely and to prepare them for export and publication, <b>C-c C-e</b> (org-export) to export buffer and prompts for a export format; includes HTML, LaTeX, OpenDocument(.odt), and PDF.
</p>
<p>
To export several files at once to a specified directory, either locally or over the network, we can define a list of projects through the variable 'org-publish-project-alist' 
</p>
<p>
Org supports a simple markup scheme for applying text formatting to exported documents:
</p>
<ul>
<li>This text is <i>emphasized</i>
</li>
<li>This text is <b>in bold</b>
</li>
<li>This text is <span style="text-decoration:underline;">underlined</span>
</li>
<li>This text uses <code>a teletype font</code>
</li>
</ul>


<blockquote>

<p>``This is a quote.''
</p>
</blockquote>





<pre class="example">This is an example.
</pre>


</div>
</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> TeX Mode</h3>
<div class="outline-text-3" id="text-1-11">

<p>Emacs provides special major modes for editing files written in TeX and its related formats. TeX is a powerful text formatter written by Donald Knuth; like GNU Emacs. Latex is a simplified input format for TeX implemented using TeX macros. DocTeX is a special file format in which the LateX sources are written, combining sources with documentation. 
</p>
<p>
TeX mode has four variants:
</p><ol>
<li>Plain TeX mode
</li>
<li>LateX mode.
</li>
<li>DocTeX mode.
</li>
<li>SliTeX mode.
</li>
</ol>


<p>
These distinc major modes differ only slightly, and are designed for editing the four different format. Emacs selects the appropriate mode by looking at the contents of the buffer. Emacs chooses the mode specified by the variable 'tex-default-mode'; its default value is latex-mode. If Emacs doesn't get it right you can select the correct variant of TeX using the command 'M-x plain-tex-mode', 'M-x latex-mode', 'M-x slitex-mode', or 'M-x doctex-mode'.
</p>
</div>

</div>
