Day7-commandsforhumanlanguages-texteditor.org
** SGML and HTML Modes
   HTML mode is slightly customizable variant of SGML mode.

| Keybindings     | Command                | Description                                                                                  |
|-----------------+------------------------+----------------------------------------------------------------------------------------------|
| C-C C-n         | sgml-name-char         | Interactively specify a special character and insert the SGML '&' command for that character |
| C-c C-t         | sgml-tag               | Specify a tag and its attribute.                                                             |
| C-c C-a         | sgml-attributes        | insert attribute value for the current tag                                                   |
| C-c C-f         | sgml-skip-tag-forward  | skip across a balanced tag group.                                                            |
| C-c C-b         | sgml-skip-tag-backward | skip backward across a balanced tag group.                                                   |
| C-c C-d         | sgml-delete-tag        | Delete the tag                                                                               |
| C-c ? TAG <RET> | sgml-tag-help          | display the description and the meaning of the tag                                           |
| C-c /           | sgml-close-tag         | insert a close tag for the innermost undetermind tag                                         |
| C-c 8           | sgml-name-8bit-mode    | Toggle a minor mode in which Latin-1 characters insert the corresponding SGML commands.      |
| C-c C-v         | sgml-validate          | run a shell commands to validate the current buffer as SGML.                                 |
| C-c <TAB>       | sgml-tags-invisible    | Toggle the visiblity of existing tags in the buffer.                                         |

There is a major mode for editing XML documents called as nXML mode. This is a mode which can recognize any XML schema and use them to provide completion on XML elements via 'M-<TAB>, as well as on the fly XML validation with error highlighting. To enable nXML mode for existing buffer type *M-x nxml-mode* or *M-x xml-mode*

For files with extension .xml nxml-mode is used by default; and for files with xhtml html-mode is used.

** Nroff mode
   This is a major mode derived from Text mode and is specialized for editing nroff files e.g. UNIX man pages. *M-x nroff-mode* enters into this mode, and runs the hook 'text-mode-hook', then 'nroff-mode-hook'; nroff command lines are treated as paragraph separators, pages are separated by '.bp' commands, and comments start with backslash-doublequote (\")

| Keybindings | Commands           | Description                                                      |
|-------------+--------------------+------------------------------------------------------------------|
| M-n         | forward-next-line  | move to the beginning of next line, which is not a nroff command |
| M-p         | backward-next-line | same but moves up                                                |
| M-?         | count-text-lines   | display in the echo area the number of text lines.               |

*M-x electric-nroff-mode* toggles the Electric Nroff mode and is a minor-mode and can be used with Nroff mode. 

** Enriched Text
   This is a minor mode for editing formatted text files in a WYSIWYG ("what you see is what you get") fashion. When Enriched mode is enabled we can apply various formatting properties to the text in the buffer. This mode is typically used by Text mode and is not compatible with Font Lock Mode which is used by many major modes, for syntax highlighting. When you save a buffer with enriched mode enabled, it is saved using the 'text/enriched' format, including the formatting indentation.

To create a new file of formatted text, visit file and type *M-x enriched-mode* 

** Editing Text Based Tables
   The table package provides commands to easily edit the text-based tables. A "table" consist of t a rectangular text area which is divided into "cells". Each cell must be one character wide and one character high, not counting its border lines. A cell can be subdivided into more cells, but they cannot overlap.

| Commands                     | Default | Description                                                      |
|------------------------------+---------+------------------------------------------------------------------|
| table-cell-vertical-char     | Pipe    | The character used for vertical lines.                           |
| table-cell-horizontal-chars  | - =     | character used for horizontal lines.                             |
| table-cell-intersection-char | +       | character used for intersection of horizontal and vertical lines |

The following are examples of _invalid_ tables:

        +-----+       +--+    +-++--+
        |     |       |  |    | ||  |
        |     |       |  |    | ||  |
        +--+  |    +--+--+    +-++--+
        |  |  |    |  |  |    +-++--+
        |  |  |    |  |  |    | ||  |
        +--+--+    +--+--+    +-++--+
           a          b          c

From left to right:

  a. Overlapped cells or non-rectangular cells are not allowed.

  b. The border must be rectangular.

  c. Cells must have a minimum width/height of one character.

** Two column editing
   Two columns lets you convinently edit two side-by-side columns of text. It uses two side-by-side windows, each showing its own buffer. There are three ways to enter two column mode:

1. <F2> 2 or C-x 6 2 - Enter two columns mode with the current buffer on the left and on the right, a buffer whose name is based on the current buffer's name.

2. <F2> s  or C-x 6 s - Split the current buffer, which contains two column text, into two buffers and display them side by side.

3. <F2> b BUFFER <RET> or C-x 6 b BUFFER <RET> - Enter two columns mode using the current buffer as the left-hand buffer, and using buffer BUFFER as the right-hand buffer.

