Day7-commandsforhumanlanguages-texteditor.html

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> SGML and HTML Modes</h3>
<div class="outline-text-3" id="text-1-12">

<p>   HTML mode is slightly customizable variant of SGML mode.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Command</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">C-C C-n</td><td class="left">sgml-name-char</td><td class="left">Interactively specify a special character and insert the SGML '&amp;' command for that character</td></tr>
<tr><td class="left">C-c C-t</td><td class="left">sgml-tag</td><td class="left">Specify a tag and its attribute.</td></tr>
<tr><td class="left">C-c C-a</td><td class="left">sgml-attributes</td><td class="left">insert attribute value for the current tag</td></tr>
<tr><td class="left">C-c C-f</td><td class="left">sgml-skip-tag-forward</td><td class="left">skip across a balanced tag group.</td></tr>
<tr><td class="left">C-c C-b</td><td class="left">sgml-skip-tag-backward</td><td class="left">skip backward across a balanced tag group.</td></tr>
<tr><td class="left">C-c C-d</td><td class="left">sgml-delete-tag</td><td class="left">Delete the tag</td></tr>
<tr><td class="left">C-c ? TAG &lt;RET&gt;</td><td class="left">sgml-tag-help</td><td class="left">display the description and the meaning of the tag</td></tr>
<tr><td class="left">C-c /</td><td class="left">sgml-close-tag</td><td class="left">insert a close tag for the innermost undetermind tag</td></tr>
<tr><td class="left">C-c 8</td><td class="left">sgml-name-8bit-mode</td><td class="left">Toggle a minor mode in which Latin-1 characters insert the corresponding SGML commands.</td></tr>
<tr><td class="left">C-c C-v</td><td class="left">sgml-validate</td><td class="left">run a shell commands to validate the current buffer as SGML.</td></tr>
<tr><td class="left">C-c &lt;TAB&gt;</td><td class="left">sgml-tags-invisible</td><td class="left">Toggle the visiblity of existing tags in the buffer.</td></tr>
</tbody>
</table>


<p>
There is a major mode for editing XML documents called as nXML mode. This is a mode which can recognize any XML schema and use them to provide completion on XML elements via 'M-&lt;TAB&gt;, as well as on the fly XML validation with error highlighting. To enable nXML mode for existing buffer type <b>M-x nxml-mode</b> or <b>M-x xml-mode</b>
</p>
<p>
For files with extension .xml nxml-mode is used by default; and for files with xhtml html-mode is used.
</p>
</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Nroff mode</h3>
<div class="outline-text-3" id="text-1-13">

<p>   This is a major mode derived from Text mode and is specialized for editing nroff files e.g. UNIX man pages. <b>M-x nroff-mode</b> enters into this mode, and runs the hook 'text-mode-hook', then 'nroff-mode-hook'; nroff command lines are treated as paragraph separators, pages are separated by '.bp' commands, and comments start with backslash-doublequote (\")
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybindings</th><th scope="col" class="left">Commands</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">M-n</td><td class="left">forward-next-line</td><td class="left">move to the beginning of next line, which is not a nroff command</td></tr>
<tr><td class="left">M-p</td><td class="left">backward-next-line</td><td class="left">same but moves up</td></tr>
<tr><td class="left">M-?</td><td class="left">count-text-lines</td><td class="left">display in the echo area the number of text lines.</td></tr>
</tbody>
</table>


<p>
<b>M-x electric-nroff-mode</b> toggles the Electric Nroff mode and is a minor-mode and can be used with Nroff mode. 
</p>
</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> Enriched Text</h3>
<div class="outline-text-3" id="text-1-14">

<p>   This is a minor mode for editing formatted text files in a WYSIWYG ("what you see is what you get") fashion. When Enriched mode is enabled we can apply various formatting properties to the text in the buffer. This mode is typically used by Text mode and is not compatible with Font Lock Mode which is used by many major modes, for syntax highlighting. When you save a buffer with enriched mode enabled, it is saved using the 'text/enriched' format, including the formatting indentation.
</p>
<p>
To create a new file of formatted text, visit file and type <b>M-x enriched-mode</b> 
</p>
</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> Editing Text Based Tables</h3>
<div class="outline-text-3" id="text-1-15">

<p>   The table package provides commands to easily edit the text-based tables. A "table" consist of t a rectangular text area which is divided into "cells". Each cell must be one character wide and one character high, not counting its border lines. A cell can be subdivided into more cells, but they cannot overlap.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Commands</th><th scope="col" class="left">Default</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">table-cell-vertical-char</td><td class="left">Pipe</td><td class="left">The character used for vertical lines.</td></tr>
<tr><td class="left">table-cell-horizontal-chars</td><td class="left">- =</td><td class="left">character used for horizontal lines.</td></tr>
<tr><td class="left">table-cell-intersection-char</td><td class="left">+</td><td class="left">character used for intersection of horizontal and vertical lines</td></tr>
</tbody>
</table>


<p>
The following are examples of <span style="text-decoration:underline;">invalid</span> tables:
</p>
<p>
Fromx left to right:
</p>
<p>
  a. Overlapped cells or non-rectangular cells are not allowed.
</p>
<p>
  b. The border must be rectangular.
</p>
<p>
  c. Cells must have a minimum width/height of one character.
</p>
</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> Two column editing</h3>
<div class="outline-text-3" id="text-1-16">

<p>   Two columns lets you convinently edit two side-by-side columns of text. It uses two side-by-side windows, each showing its own buffer. There are three ways to enter two column mode:
</p>
<ol>
<li>&lt;F2&gt; 2 or C-x 6 2 - Enter two columns mode with the current buffer on the left and on the right, a buffer whose name is based on the current buffer's name.

</li>
<li>&lt;F2&gt; s  or C-x 6 s - Split the current buffer, which contains two column text, into two buffers and display them side by side.

</li>
<li>&lt;F2&gt; b BUFFER &lt;RET&gt; or C-x 6 b BUFFER &lt;RET&gt; - Enter two columns mode using the current buffer as the left-hand buffer, and using buffer BUFFER as the right-hand buffer.
</li>
</ol>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-10-05T18:42+0530</p>
<p class="author">Author: Om Prakash Singh</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
